CF/Documents/МаркетинговаяАкция.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>МаркетинговаяАкция</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДействиеСкидокНаценок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеАкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазинов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВсехМагазиновОдноРасписаниеСкидок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Магазины</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СкидкиНаценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Магазин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНаценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидкиНаценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CF/Catalogs/Магазины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Магазины</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМинимальныхЦенПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриОтгрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПеремещении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОрдернуюСхемуПриПоступлении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрименениеЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</Name>
					<Comment>Порядок округления суммы чека в пользу покупателя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоЦенообразования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПравилаЦенообразования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментИсключаемойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматМагазина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФорматыМагазинов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладУправляющейСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПрямуюИнкассацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьАссортимент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьАссортиментВЗаказеПокупателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МетодРасчетаПотребности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыРасчетаПотребности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОкругленияЧекаВПользуПокупателя</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлощадьТорговогоЗала</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CF/Documents/МаркетинговаяАкция/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Если ДокументСсылка.ДляВсехМагазинов ИЛИ НЕ ДокументСсылка.ДляВсехМагазиновОдноРасписаниеСкидок Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МаркетинговаяАкцияСкидкиНаценки.Ссылка,
		|	МаркетинговаяАкцияСкидкиНаценки.НомерСтроки,
		|	МаркетинговаяАкцияСкидкиНаценки.ДатаНачала КАК ПЕРИОД,
		|	МаркетинговаяАкцияСкидкиНаценки.ДатаОкончания,
		|	МаркетинговаяАкцияСкидкиНаценки.Магазин,
		|	МаркетинговаяАкцияСкидкиНаценки.СкидкаНаценка
		|ИЗ
		|	Документ.МаркетинговаяАкция.СкидкиНаценки КАК МаркетинговаяАкцияСкидкиНаценки
		|ГДЕ
		|	МаркетинговаяАкцияСкидкиНаценки.Ссылка = &Ссылка";
		
	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МаркетинговаяАкцияСкидкиНаценки.ДатаОкончания,
		|	МаркетинговаяАкцияСкидкиНаценки.ДатаНачала,
		|	МаркетинговаяАкцияСкидкиНаценки.СкидкаНаценка,
		|	МаркетинговаяАкцияСкидкиНаценки.Ссылка,
		|	МаркетинговаяАкцияСкидкиНаценки.НомерСтроки
		|ПОМЕСТИТЬ ТаблицаСкидок
		|ИЗ
		|	Документ.МаркетинговаяАкция.СкидкиНаценки КАК МаркетинговаяАкцияСкидкиНаценки
		|ГДЕ
		|	МаркетинговаяАкцияСкидкиНаценки.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МаркетинговаяАкцияМагазины.Ссылка,
		|	МаркетинговаяАкцияМагазины.Магазин
		|ПОМЕСТИТЬ ТаблицаМагазинов
		|ИЗ
		|	Документ.МаркетинговаяАкция.Магазины КАК МаркетинговаяАкцияМагазины
		|ГДЕ
		|	МаркетинговаяАкцияМагазины.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ТаблицаМагазинов.Магазин, ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)) КАК Магазин,
		|	ТаблицаСкидок.ДатаОкончания,
		|	ТаблицаСкидок.ДатаНачала КАК Период,
		|	ТаблицаСкидок.СкидкаНаценка,
		|	ТаблицаСкидок.НомерСтроки
		|ИЗ
		|	ТаблицаСкидок КАК ТаблицаСкидок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаМагазинов КАК ТаблицаМагазинов
		|		ПО ТаблицаСкидок.Ссылка = ТаблицаМагазинов.Ссылка";
		
	КонецЕсли;
	
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаДействиеСкидокНаценок", ТаблицаРезультат);
	
КонецПроцедуры

// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "МаркетинговаяАкция") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "МаркетинговаяАкция",
				НСтр("ru = 'Маркетинговая акция'"),
				ПечатьМаркетинговаяАкция(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Переоценка товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "МаркетинговаяАкция";
	КомандаПечати.Представление = НСтр("ru = 'Маркетинговая акция'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 75;
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция формирует табличный документ с печатной формой.
//
// Возвращаемое значение:
//  ТабличныйДокумент - печатная форма.
//
Функция ПечатьМаркетинговаяАкция(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент  = Новый ТабличныйДокумент;
	РеквизитыДокумента = Новый Структура("Номер, Дата, Префикс");
	СинонимДокумента   = НСтр("ru='Маркетинговая акция'");
	
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_МаркетинговаяАкция";
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Документ.Ссылка,
	|	Документ.Дата,
	|	Документ.ДляВсехМагазинов,
	|	Документ.ДляВсехМагазиновОдноРасписаниеСкидок,
	|	Документ.НаименованиеАкции,
	|	Документ.Описание,
	|	Документ.ДатаНачалаДействия,
	|	Документ.ДатаОкончанияДействия
	|ИЗ
	|	Документ.МаркетинговаяАкция КАК Документ
	|ГДЕ
	|	Документ.Ссылка В(&МассивОбъектов)
	|	И Документ.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Документ.Ссылка,
	|	Документ.Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МаркетинговаяАкцияМагазины.Ссылка КАК Ссылка,
	|	МаркетинговаяАкцияМагазины.НомерСтроки,
	|	МаркетинговаяАкцияМагазины.Магазин
	|ИЗ
	|	Документ.МаркетинговаяАкция.Магазины КАК МаркетинговаяАкцияМагазины
	|ГДЕ
	|	МаркетинговаяАкцияМагазины.Ссылка В(&МассивОбъектов)
	|	И МаркетинговаяАкцияМагазины.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МаркетинговаяАкцияСкидкиНаценки.Ссылка КАК Ссылка,
	|	МаркетинговаяАкцияСкидкиНаценки.НомерСтроки,
	|	МаркетинговаяАкцияСкидкиНаценки.ДатаНачала,
	|	МаркетинговаяАкцияСкидкиНаценки.ДатаОкончания,
	|	МаркетинговаяАкцияСкидкиНаценки.Магазин КАК Магазин,
	|	МаркетинговаяАкцияСкидкиНаценки.СкидкаНаценка,
	|	ВЫБОР
	|		КОГДА МаркетинговаяАкцияСкидкиНаценки.Магазин = ЗНАЧЕНИЕ(Справочник.Магазины.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПустойМагазин
	|ИЗ
	|	Документ.МаркетинговаяАкция.СкидкиНаценки КАК МаркетинговаяАкцияСкидкиНаценки
	|ГДЕ
	|	МаркетинговаяАкцияСкидкиНаценки.Ссылка В(&МассивОбъектов)
	|	И МаркетинговаяАкцияСкидкиНаценки.Ссылка.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	ПустойМагазин
	|ИТОГИ ПО
	|	Ссылка,
	|	Магазин");
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.МаркетинговаяАкция.ПФ_MXL_МаркетинговаяАкция");
	
	ОбластьЗаголовок           = Макет.ПолучитьОбласть("Заголовок");
	ОбластьИнформационноеПоле  = Макет.ПолучитьОбласть("ИнформационноеПоле");
	ОбластьШапкаСкидкиНаценки  = Макет.ПолучитьОбласть("ШапкаСкидкиНаценки");
	ОбластьСтрокаСкидкиНаценки = Макет.ПолучитьОбласть("СтрокаСкидкиНаценки");
	
	ОбластьШапкаМагазины  = Макет.ПолучитьОбласть("ШапкаМагазины");
	ОбластьСтрокаМагазины = Макет.ПолучитьОбласть("СтрокаМагазины");
	
	ОбластьШапкаМагазиныСкидки  = Макет.ПолучитьОбласть("ШапкаМагазиныСкидки");
	ОбластьСтрокаМагазиныСкидки = Макет.ПолучитьОбласть("СтрокаМагазиныСкидки");
	
	ВыборкаПоДокументам = Результаты[0].Выбрать();
	ВыборкаПоТаблицыМагазины = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаПоТаблицеСкидкиНаценки = Результаты[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
		
		Если НЕ ВыборкаПоТаблицеСкидкиНаценки.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		ВыборкаПоСтрокамТЧГруппировкаМагазин = ВыборкаПоТаблицеСкидкиНаценки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ЕстьМагазины = Истина;
		Если НЕ ВыборкаПоТаблицыМагазины.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			ЕстьМагазины = Ложь;
		Иначе
			ВыборкаПоСтрокамТЧМагазины = ВыборкаПоТаблицыМагазины.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		КонецЕсли;
		
		Если НЕ ПервыйДокумент Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок.Параметры.Наименование   = ВыборкаПоДокументам.НаименованиеАкции;
		ОбластьЗаголовок.Параметры.Описание       = ВыборкаПоДокументам.Описание;
		
		ДатаОкончанияДействияВОтчет = ВыборкаПоДокументам.ДатаОкончанияДействия;
		
		Если Не ДатаОкончанияДействияВОтчет = Дата('00010101000000') Тогда
			ДатаОкончанияДействияВОтчет = КонецДня(ДатаОкончанияДействияВОтчет)
		КонецЕсли;
		
		ОбластьЗаголовок.Параметры.ПериодДействия = ПредставлениеПериода(ВыборкаПоДокументам.ДатаНачалаДействия, ДатаОкончанияДействияВОтчет);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		
		Если ВыборкаПоДокументам.ДляВсехМагазинов Тогда
			
			ОбластьИнформационноеПоле.Параметры.ИнформацияОДанных = НСтр("ru = 'Для всех магазинов'");
			ТабличныйДокумент.Вывести(ОбластьИнформационноеПоле);
			ТабличныйДокумент.Вывести(ОбластьШапкаСкидкиНаценки);
			
			Если ВыборкаПоСтрокамТЧГруппировкаМагазин.Следующий() Тогда
				
				ВыборкаПоСтрокамТЧ = ВыборкаПоСтрокамТЧГруппировкаМагазин.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
					ОбластьСтрокаСкидкиНаценки.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
					ТабличныйДокумент.Вывести(ОбластьСтрокаСкидкиНаценки);
				КонецЦикла;
			КонецЕсли;
			
		ИначеЕсли ВыборкаПоДокументам.ДляВсехМагазиновОдноРасписаниеСкидок Тогда
			
			Если Не ЕстьМагазины Тогда
				Продолжить;
			КонецЕсли;
			
			ОбластьИнформационноеПоле.Параметры.ИнформацияОДанных = НСтр("ru = 'Одно расписание для магазинов'");
			ТабличныйДокумент.Вывести(ОбластьИнформационноеПоле);
			ТабличныйДокумент.Вывести(ОбластьШапкаМагазиныСкидки);
			
			
			Если ВыборкаПоСтрокамТЧГруппировкаМагазин.Следующий() Тогда
				
				ВыборкаПоСтрокамТЧ = ВыборкаПоСтрокамТЧГруппировкаМагазин.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				КоличествоМагазинов = ВыборкаПоСтрокамТЧМагазины.Количество();
				КоличествоСкидок    = ВыборкаПоСтрокамТЧ.Количество();
			
				Для Индекс = 1 По Макс(КоличествоМагазинов,КоличествоСкидок) Цикл
				
					
					Если Индекс <= КоличествоСкидок Тогда
						ВыборкаПоСтрокамТЧ.Следующий();
						ОбластьСтрокаМагазиныСкидки.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
					КонецЕсли;
					
					Если Индекс <= КоличествоМагазинов Тогда
						ВыборкаПоСтрокамТЧМагазины.Следующий();
						ОбластьСтрокаМагазиныСкидки.Параметры.Магазин = ВыборкаПоСтрокамТЧМагазины.Магазин;
					КонецЕсли;
					
					ТабличныйДокумент.Вывести(ОбластьСтрокаМагазиныСкидки);
				КонецЦикла;
			КонецЕсли;
		Иначе
			
			Пока ВыборкаПоСтрокамТЧГруппировкаМагазин.Следующий() Цикл
				Если ВыборкаПоСтрокамТЧГруппировкаМагазин.ПустойМагазин Тогда
					ОбластьИнформационноеПоле.Параметры.ИнформацияОДанных = НСтр("ru = 'Для всех магазинов'");
				Иначе
					ОбластьИнформационноеПоле.Параметры.ИнформацияОДанных = ВыборкаПоСтрокамТЧГруппировкаМагазин.Магазин;
				КонецЕсли;
				
				ТабличныйДокумент.Вывести(ОбластьИнформационноеПоле);
				ТабличныйДокумент.Вывести(ОбластьШапкаСкидкиНаценки);
				
				ВыборкаПоСтрокамТЧ = ВыборкаПоСтрокамТЧГруппировкаМагазин.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
					ОбластьСтрокаСкидкиНаценки.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
					ТабличныйДокумент.Вывести(ОбластьСтрокаСкидкиНаценки);
				КонецЦикла;
				
			КонецЦикла;
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаПоДокументам.Ссылка);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
КонецФункции

#КонецОбласти

#КонецЕсли
